export const SHIFT = "shift";
export const ENTER = "enter";
export const BACKSPACE = "backspace";
export const SPACE = "space";
export const NOOP = "noop";

export const ORIGINAL_LAYOUT: string[][] = [
    // Row 1: numbers (excluding backspace)
    ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", BACKSPACE], // 13
    // Row 2: QWERTY top row
    ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "[", "]", "\\"], // 13
    // Row 3: ASDF row  (excluding enter)
    ["a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", ENTER], // 12
    // Row 4: ZXCV row (excluding shift and space)
    [SHIFT, "\\", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/", SPACE], // 13
];

// https://en.wikipedia.org/wiki/List_of_ISO_639-2_codes
export type LanguageCode = "TH" | "TR" | "VI" | "LO" | "IT" | "DE" | "KR";
export type LayoutKey = LanguageCode | `${LanguageCode}_`;

export const KEYBOARD_LAYOUTS: Record<LayoutKey, string[][]> = {
    TH: [
        ["ๅ", "/", "-", "ภ", "ถ", "ุ", "ึ", "ค", "ต", "จ", "ข", "ช", BACKSPACE],
        ["ๆ", "ไ", "ำ", "พ", "ะ", "ั", "ี", "ร", "น", "ย", "บ", "ล", "ฃ"],
        ["ฟ", "ห", "ก", "ด", "เ", "้", "่", "า", "ส", "ว", "ง", ENTER],
        [SHIFT, "ฃ", "ผ", "ป", "แ", "อ", "ิ", "ื", "ท", "ม", "ใ", "ฝ", SPACE],
    ],
    TH_: [
        ["+", "๑", "๒", "๓", "๔", "ู", "฿", "๕", "๖", "๗", "๘", "๙", BACKSPACE],
        ["๐", '"', "ฎ", "ฑ", "ธ", "ํ", "๊", "ณ", "ฯ", "ญ", "ฐ", ",", "ฅ"],
        ["ฤ", "ฆ", "ฏ", "โ", "ฬ", "็", "๋", "ษ", "ศ", "ซ", ".", ENTER],
        [SHIFT, "ฅ", "(", ")", "ฉ", "ฮ", "ฺ", "์", "?", "ฒ", "ฬ", "ฦ", SPACE],
    ],
    TR: [
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "*", "-", BACKSPACE],
        ["q", "w", "e", "r", "t", "y", "u", "ı", "o", "p", "ğ", "ü", ","],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l", "ş", "i", ENTER],
        [SHIFT, ",", "z", "x", "c", "v", "b", "n", "m", "ö", "ç", ".", SPACE],
    ],
    TR_: [
        ["!", "'", "^", "+", "%", "&", "/", "(", ")", "=", "?", "_", BACKSPACE],
        ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "Ğ", "Ü", ";"],
        ["A", "S", "D", "F", "G", "H", "J", "K", "L", "Ş", "İ", ENTER],
        [SHIFT, ";", "Z", "X", "C", "V", "B", "N", "M", "Ö", "Ç", ":", SPACE],
    ],
    VI: [
        ["ă", "â", "ê", "ô", "̀", "̉", "̃", "́", "̣", "đ", "-", "₫", BACKSPACE],
        ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "ư", "ơ", "\\"],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", ENTER],
        [SHIFT, "\\", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/", SPACE],
    ],
    VI_: [
        ["Ă", "Â", "Ê", "Ô", "̀", "̉", "̃", "́", "̣", "Đ", "_", "+", BACKSPACE],
        ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "Ư", "Ơ", "|"],
        ["A", "S", "D", "F", "G", "H", "J", "K", "L", ":", '"', ENTER],
        [SHIFT, "|", "Z", "X", "C", "V", "B", "N", "M", "<", ">", "?", SPACE],
    ],
    LO: [
        ["ຢ", "ຟ", "ໂ", "ຖ", "ຸ", "ູ", "ຄ", "ຕ", "ຈ", "ຂ", "ຊ", "ໍ", BACKSPACE],
        ["ົ", "ໄ", "ຳ", "ພ", "ະ", "ິ", "ີ", "ຮ", "ນ", "ຍ", "ບ", "ລ", "/"],
        ["ັ", "ຫ", "ກ", "ດ", "ເ", "້", "່", "າ", "ສ", "ວ", "ງ", ENTER],
        [SHIFT, "/", "ຜ", "ປ", "ແ", "ອ", "ຶ", "ື", "ທ", "ມ", "ໃ", "ຝ", SPACE],
    ],
    LO_: [
        ["໑", "໒", "໓", "໔", "໌", "ຼ", "໕", "໖", "໗", "໘", "໙", "ໍ", BACKSPACE],
        ["ົ້", "໐", "ຳ້", "_", "+", "ິ້", "ີ້", "ຣ", "ໜ", "ຽ", "-", "ຫຼ", "\\"],
        ["ັ້", ";", ".", ",", ":", "໊", "໋", "!", "?", "%", "=", ENTER],
        [SHIFT, "\\", "₭", "(", "ຯ", "x", "ຶ້", "ື້", "ໆ", "ໝ", "$", ")", SPACE],
    ],
    IT: [
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "'", "ì", BACKSPACE],
        ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "è", "+", "ù"],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l", "ò", "à", ENTER],
        [SHIFT, "ù", "z", "x", "c", "v", "b", "n", "m", ",", ".", "-", SPACE],
    ],
    IT_: [
        ["!", '"', "£", "$", "%", "&", "/", "(", ")", "=", "?", "í", BACKSPACE],
        ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "é", "*", "ú"],
        ["A", "S", "D", "F", "G", "H", "J", "K", "L", "ç", "ó", ENTER],
        [SHIFT, "ú", "Z", "X", "C", "V", "B", "N", "M", ";", ":", "_", SPACE],
    ],
    DE: [
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "ß", "´", BACKSPACE],
        ["q", "w", "e", "r", "t", "z", "u", "i", "o", "p", "ü", "+", "#"],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l", "ö", "ä", ENTER],
        [SHIFT, "#", "y", "x", "c", "v", "b", "n", "m", ",", ".", "-", SPACE],
    ],
    DE_: [
        ["!", '"', "§", "$", "%", "&", "/", "(", ")", "=", "?", "`", BACKSPACE],
        ["Q", "W", "E", "R", "T", "Z", "U", "I", "O", "P", "Ü", "*", "'"],
        ["A", "S", "D", "F", "G", "H", "J", "K", "L", "Ö", "Ä", ENTER],
        [SHIFT, "'", "Y", "X", "C", "V", "B", "N", "M", ";", ":", "_", SPACE],
    ],
    KR: [
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", BACKSPACE],
        ["ㅂ", "ㅈ", "ㄷ", "ㄱ", "ㅅ", "ㅛ", "ㅕ", "ㅑ", "ㅐ", "ㅔ", "[", "]", "\\"],
        ["ㅁ", "ㄴ", "ㅇ", "ㄹ", "ㅎ", "ㅗ", "ㅓ", "ㅏ", "ㅣ", ";", "'", ENTER],
        [SHIFT, "\\", "ㅋ", "ㅌ", "ㅊ", "ㅍ", "ㅠ", "ㅜ", "ㅡ", ",", ".", "/", SPACE],
    ],
    KR_: [
        ["!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", BACKSPACE],
        ["ㅃ", "ㅉ", "ㄸ", "ㄲ", "ㅆ", NOOP, NOOP, NOOP, "ㅒ", "ㅖ", "{", "}", "|"],
        [NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, ":", '"', ENTER],
        [SHIFT, "|", NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, NOOP, "<", ">", "?", SPACE],
    ],
};
